In [ ]:
# 문제 설명(k번째 수)
# 배열 array의 i번째 숫자부터 j번째 숫자까지 자르고 정렬했을 때, k번째에 있는 수를 구하려 합니다.

# 예를 들어 array가 [1, 5, 2, 6, 3, 7, 4], i = 2, j = 5, k = 3이라면

# array의 2번째부터 5번째까지 자르면 [5, 2, 6, 3]입니다.
# 1에서 나온 배열을 정렬하면 [2, 3, 5, 6]입니다.
# 2에서 나온 배열의 3번째 숫자는 5입니다.
# 배열 array, [i, j, k]를 원소로 가진 2차원 배열 commands가 매개변수로 주어질 때, commands의 모든 원소에 대해 앞서 설명한 연산을 적용했을 때 나온 결과를 배열에 담아 return 하도록 solution 함수를 작성해주세요.

# 제한사항
# array의 길이는 1 이상 100 이하입니다.
# array의 각 원소는 1 이상 100 이하입니다.
# commands의 길이는 1 이상 50 이하입니다.
# commands의 각 원소는 길이가 3입니다.

In [ ]:
# 문제 요약
# 정수 배열 array와 여러 개의 commands가 주어짐
# 각 command는 [i, j, k] 형태임
# 각각의 command에 대해:
# array에서 i번째부터 j번째까지 자른다. (1-based index)
# 자른 배열을 정렬한다.
# 정렬된 배열에서 k번째 수를 뽑는다.
# 이 과정을 각 command마다 수행해서 뽑은 수들을 모아 리스트로 반환.

In [ ]:
# sol1
def solution(array, commands):
    answer = []
    for i in range(len(commands)):
        # i~j 자르기
        arr = array[commands[i][0] - 1: commands[i][1]]
        arr.sort()
        # k번째 수 추출
        answer.append(arr[commands[i][2] - 1])
    return answer

In [ ]:
# sol2
def solution(array, commands):
    return [sorted(array[i-1 : j])[k - 1] for i, j, k in commands]

In [ ]:
# sol3
def solution(array, commands):
    return list(map(lambda x: sorted(array[x[0] - 1: x[1]])[x[2] - 1], commands))

In [ ]:
# 문제 설명(모의고사)
# 수포자는 수학을 포기한 사람의 준말입니다. 수포자 삼인방은 모의고사에 수학 문제를 전부 찍으려 합니다. 수포자는 1번 문제부터 마지막 문제까지 다음과 같이 찍습니다.

# 1번 수포자가 찍는 방식: 1, 2, 3, 4, 5, 1, 2, 3, 4, 5, ...
# 2번 수포자가 찍는 방식: 2, 1, 2, 3, 2, 4, 2, 5, 2, 1, 2, 3, 2, 4, 2, 5, ...
# 3번 수포자가 찍는 방식: 3, 3, 1, 1, 2, 2, 4, 4, 5, 5, 3, 3, 1, 1, 2, 2, 4, 4, 5, 5, ...

# 1번 문제부터 마지막 문제까지의 정답이 순서대로 들은 배열 answers가 주어졌을 때, 가장 많은 문제를 맞힌 사람이 누구인지 배열에 담아 return 하도록 solution 함수를 작성해주세요.

# 제한 조건
# 시험은 최대 10,000 문제로 구성되어있습니다.
# 문제의 정답은 1, 2, 3, 4, 5중 하나입니다.
# 가장 높은 점수를 받은 사람이 여럿일 경우, return하는 값을 오름차순 정렬해주세요.

In [ ]:
# 문제 요약
# 3명의 수포자가 문제를 일정한 패턴으로 찍기 시작함
# 실제 정답이 담긴 answers 리스트가 주어졌을 때,
# 누가 가장 많이 맞췄는지 1번, 2번, 3번 중 가장 높은 점수를 받은 사람을 반환해야 함
# 만약 동점이면, 모두 리스트에 포함해서 반환

In [ ]:
# sol1
def solution(answers):
    answer = []
    
    people1 = [1, 2, 3, 4, 5]
    people2 = [2, 1, 2, 3, 2, 4, 2, 5]
    people3 = [3, 3, 1, 1, 2, 2, 4, 4, 5, 5]
    
    count1 = 0
    count2 = 0
    count3 = 0
    for i in range(len(answers)):
        if (people1[i - len(people1) * (i // len(people1))] == answers[i]):
                count1 += 1
        if (people2[i - len(people2) * (i // len(people2))] == answers[i]):
                count2 += 1
        if (people3[i - len(people3) * (i // len(people3))] == answers[i]):
                count3 += 1
            
    if (count1 == max(count1, count2, count3)):
        answer.append(1)
    if (count2 == max(count1, count2, count3)):
        answer.append(2)
    if (count3 == max(count1, count2, count3)):
        answer.append(3)
        
    return answer

In [ ]:
# sol2
def solution(answers):
    pattern1 = [1, 2, 3, 4, 5]
    pattern2 = [2, 1, 2, 3, 2, 4, 2, 5]
    pattern3 = [3, 3, 1, 1, 2, 2, 4, 4, 5, 5]
    score = [0, 0, 0]
    result = []
    
    for idx, answer in enumerate(answers):
        # 각 패턴이 반복되도록 인덱스 순환
        if answer == pattern1[idx%len(pattern1)]:
            score[0] += 1
        if answer == pattern2[idx%len(pattern2)]:
            score[1] += 1
        if answer == pattern3[idx%len(pattern3)]:
            score[2] += 1
    # 최고 점수와 같은 사람(동점자 포함)은 result에 추가
    for idx, s in enumerate(score):
        if s == max(score):
            result.append(idx + 1)
    return result

In [ ]:
# 문제 설명(최솟값 구하기)
# ANIMAL_INS 테이블은 동물 보호소에 들어온 동물의 정보를 담은 테이블입니다. ANIMAL_INS 테이블 구조는 다음과 같으며, ANIMAL_ID, ANIMAL_TYPE, DATETIME, INTAKE_CONDITION, NAME, SEX_UPON_INTAKE는 각각 동물의 아이디, 생물 종, 보호 시작일, 보호 시작 시 상태, 이름, 성별 및 중성화 여부를 나타냅니다.

# NAME	TYPE	NULLABLE
# ANIMAL_ID	VARCHAR(N)	FALSE
# ANIMAL_TYPE	VARCHAR(N)	FALSE
# DATETIME	DATETIME	FALSE
# INTAKE_CONDITION	VARCHAR(N)	FALSE
# NAME	VARCHAR(N)	TRUE
# SEX_UPON_INTAKE	VARCHAR(N)	FALSE
# 동물 보호소에 가장 먼저 들어온 동물은 언제 들어왔는지 조회하는 SQL 문을 작성해주세요.

# 예시
# 예를 들어 ANIMAL_INS 테이블이 다음과 같다면

# ANIMAL_ID	ANIMAL_TYPE	DATETIME	INTAKE_CONDITION	NAME	SEX_UPON_INTAKE
# A399552	Dog	2013-10-14 15:38:00	Normal	Jack	Neutered Male
# A379998	Dog	2013-10-23 11:42:00	Normal	Disciple	Intact Male
# A370852	Dog	2013-11-03 15:04:00	Normal	Katie	Spayed Female
# A403564	Dog	2013-11-18 17:03:00	Normal	Anna	Spayed Female
# 가장 먼저 들어온 동물은 Jack이고, Jack은 2013-10-14 15:38:00에 들어왔습니다. 따라서 SQL문을 실행하면 다음과 같이 나와야 합니다.

# 시간
# 2013-10-14 15:38:00
# ※ 컬럼 이름(위 예제에서는 "시간")은 일치하지 않아도 됩니다.

In [ ]:
SELECT min(DATETIME) as 시간 FROM ANIMAL_INS;

In [ ]:
# 문제 설명(고양이와 개는 몇 마리 있을까)
# ANIMAL_INS 테이블은 동물 보호소에 들어온 동물의 정보를 담은 테이블입니다. ANIMAL_INS 테이블 구조는 다음과 같으며, ANIMAL_ID, ANIMAL_TYPE, DATETIME, INTAKE_CONDITION, NAME, SEX_UPON_INTAKE는 각각 동물의 아이디, 생물 종, 보호 시작일, 보호 시작 시 상태, 이름, 성별 및 중성화 여부를 나타냅니다.

# NAME	TYPE	NULLABLE
# ANIMAL_ID	VARCHAR(N)	FALSE
# ANIMAL_TYPE	VARCHAR(N)	FALSE
# DATETIME	DATETIME	FALSE
# INTAKE_CONDITION	VARCHAR(N)	FALSE
# NAME	VARCHAR(N)	TRUE
# SEX_UPON_INTAKE	VARCHAR(N)	FALSE
# 동물 보호소에 들어온 동물 중 고양이와 개가 각각 몇 마리인지 조회하는 SQL문을 작성해주세요. 이때 고양이를 개보다 먼저 조회해주세요.

# 예시
# 예를 들어 ANIMAL_INS 테이블이 다음과 같다면

# ANIMAL_ID	ANIMAL_TYPE	DATETIME	INTAKE_CONDITION	NAME	SEX_UPON_INTAKE
# A373219	Cat	2014-07-29 11:43:00	Normal	Ella	Spayed Female
# A377750	Dog	2017-10-25 17:17:00	Normal	Lucy	Spayed Female
# A354540	Cat	2014-12-11 11:48:00	Normal	Tux	Neutered Male
# 고양이는 2마리, 개는 1마리 들어왔습니다. 따라서 SQL문을 실행하면 다음과 같이 나와야 합니다.

# ANIMAL_TYPE	count
# Cat	2
# Dog	1

In [ ]:
SELECT ANIMAL_TYPE, count(*) as count FROM ANIMAL_INS
GROUP BY ANIMAL_TYPE
ORDER BY ANIMAL_TYPE ASC;

In [ ]:
# 문제설명(동명 동물 수 찾기)
# 동물 보호소에 들어온 동물 이름 중 두 번 이상 쓰인 이름과 해당 이름이 쓰인 횟수를 조회하는 SQL문을 작성해주세요. 이때 결과는 이름이 없는 동물은 집계에서 제외하며, 결과는 이름 순으로 조회해주세요.

# 예시
# 예를 들어 ANIMAL_INS 테이블이 다음과 같다면

# ANIMAL_ID	ANIMAL_TYPE	DATETIME	INTAKE_CONDITION	NAME	SEX_UPON_INTAKE
# A396810	Dog	2016-08-22 16:13:00	Injured	Raven	Spayed Female
# A377750	Dog	2017-10-25 17:17:00	Normal	Lucy	Spayed Female
# A355688	Dog	2014-01-26 13:48:00	Normal	Shadow	Neutered Male
# A399421	Dog	2015-08-25 14:08:00	Normal	Lucy	Spayed Female
# A400680	Dog	2017-06-17 13:29:00	Normal	Lucy	Spayed Female
# A410668	Cat	2015-11-19 13:41:00	Normal	Raven	Spayed Female
# Raven 이름은 2번 쓰였습니다.
# Lucy 이름은 3번 쓰였습니다
# Shadow 이름은 1번 쓰였습니다.
# 따라서 SQL문을 실행하면 다음과 같이 나와야 합니다.

# NAME	COUNT
# Lucy	3
# Raven	2

In [ ]:
SELECT NAME, COUNT(NAME) AS COUNT FROM ANIMAL_INS
GROUP BY NAME HAVING COUNT(NAME)> 1
ORDER BY NAME ASC;

In [ ]:
# 문제설명(루시와 엘라 찾기)
# 동물 보호소에 들어온 동물 중 이름이 Lucy, Ella, Pickle, Rogan, Sabrina, Mitty인 동물의 아이디와 이름, 성별 및 중성화 여부를 조회하는 SQL 문을 작성해주세요.

# 예시
# 이때 결과는 아이디 순으로 조회해주세요. 예를 들어 ANIMAL_INS 테이블이 다음과 같다면

# ANIMAL_ID	ANIMAL_TYPE	DATETIME	INTAKE_CONDITION	NAME	SEX_UPON_INTAKE
# A373219	Cat	2014-07-29 11:43:00	Normal	Ella	Spayed Female
# A377750	Dog	2017-10-25 17:17:00	Normal	Lucy	Spayed Female
# A353259	Dog	2016-05-08 12:57:00	Injured	Bj	Neutered Male
# A354540	Cat	2014-12-11 11:48:00	Normal	Tux	Neutered Male
# A354597	Cat	2014-05-02 12:16:00	Normal	Ariel	Spayed Female
# SQL문을 실행하면 다음과 같이 나와야 합니다.

# ANIMAL_ID	NAME	SEX_UPON_INTAKE
# A373219	Ella	Spayed Female
# A377750	Lucy	Spayed Female

In [ ]:
SELECT ANIMAL_ID, NAME, SEX_UPON_INTAKE FROM ANIMAL_INS
WHERE NAME IN('Lucy', 'Ella', 'Pickle', 'Rogan', 'Sabrina', 'Mitty')
GROUP BY ANIMAL_ID;

In [ ]:
# 문제설명(이름에 el이 들어가는 동물 찾기)
# 보호소에 돌아가신 할머니가 기르던 개를 찾는 사람이 찾아왔습니다. 이 사람이 말하길 할머니가 기르던 개는 이름에 'el'이 들어간다고 합니다. 동물 보호소에 들어온 동물 이름 중, 이름에 "EL"이 들어가는 개의 아이디와 이름을 조회하는 SQL문을 작성해주세요. 이때 결과는 이름 순으로 조회해주세요. 단, 이름의 대소문자는 구분하지 않습니다.

# 예시
# 예를 들어 ANIMAL_INS 테이블이 다음과 같다면

# ANIMAL_ID	ANIMAL_TYPE	DATETIME	INTAKE_CONDITION	NAME	SEX_UPON_INTAKE
# A355753	Dog	2015-09-10 13:14:00	Normal	Elijah	Neutered Male
# A352872	Dog	2015-07-09 17:51:00	Aged	Peanutbutter	Neutered Male
# A353259	Dog	2016-05-08 12:57:00	Injured	Bj	Neutered Male
# A373219	Cat	2014-07-29 11:43:00	Normal	Ella	Spayed Female
# A382192	Dog	2015-03-13 13:14:00	Normal	Maxwell 2	Intact Male
# 이름에 'el'이 들어가는 동물은 Elijah, Ella, Maxwell 2입니다.
# 이 중, 개는 Elijah, Maxwell 2입니다.
# 따라서 SQL문을 실행하면 다음과 같이 나와야 합니다.

# ANIMAL_ID	NAME
# A355753	Elijah
# A382192	Maxwell 2

In [ ]:
SELECT ANIMAL_ID, NAME FROM ANIMAL_INS
WHERE NAME LIKE '%el%' AND ANIMAL_TYPE = 'Dog'
GROUP BY ANIMAL_ID, NAME
ORDER BY NAME;

In [ ]:
# 문제 설명(동물 수 구하기)
# ANIMAL_INS 테이블은 동물 보호소에 들어온 동물의 정보를 담은 테이블입니다. ANIMAL_INS 테이블 구조는 다음과 같으며, ANIMAL_ID, ANIMAL_TYPE, DATETIME, INTAKE_CONDITION, NAME, SEX_UPON_INTAKE는 각각 동물의 아이디, 생물 종, 보호 시작일, 보호 시작 시 상태, 이름, 성별 및 중성화 여부를 나타냅니다.

# NAME	TYPE	NULLABLE
# ANIMAL_ID	VARCHAR(N)	FALSE
# ANIMAL_TYPE	VARCHAR(N)	FALSE
# DATETIME	DATETIME	FALSE
# INTAKE_CONDITION	VARCHAR(N)	FALSE
# NAME	VARCHAR(N)	TRUE
# SEX_UPON_INTAKE	VARCHAR(N)	FALSE
# 동물 보호소에 동물이 몇 마리 들어왔는지 조회하는 SQL 문을 작성해주세요.

# 예시
# 예를 들어 ANIMAL_INS 테이블이 다음과 같다면

# ANIMAL_ID	ANIMAL_TYPE	DATETIME	INTAKE_CONDITION	NAME	SEX_UPON_INTAKE
# A399552	Dog	2013-10-14 15:38:00	Normal	Jack	Neutered Male
# A379998	Dog	2013-10-23 11:42:00	Normal	Disciple	Intact Male
# A370852	Dog	2013-11-03 15:04:00	Normal	Katie	Spayed Female
# A403564	Dog	2013-11-18 17:03:00	Normal	Anna	Spayed Female
# 동물 보호소에 들어온 동물은 4마리입니다. 따라서 SQL문을 실행하면 다음과 같이 나와야 합니다.

# count
# 4
# ※ 컬럼 이름(위 예제에서는 count)은 일치하지 않아도 됩니다.

In [ ]:
SELECT count(*) as count FROM ANIMAL_INS;

In [ ]:
# 문제설명(중복 제거하기)
# 동물 보호소에 들어온 동물의 이름은 몇 개인지 조회하는 SQL 문을 작성해주세요. 이때 이름이 NULL인 경우는 집계하지 않으며 중복되는 이름은 하나로 칩니다.

# 예시
# 예를 들어 ANIMAL_INS 테이블이 다음과 같다면

# ANIMAL_ID	ANIMAL_TYPE	DATETIME	INTAKE_CONDITION	NAME	SEX_UPON_INTAKE
# A562649	Dog	2014-03-20 18:06:00	Sick	NULL	Spayed Female
# A412626	Dog	2016-03-13 11:17:00	Normal	*Sam	Neutered Male
# A563492	Dog	2014-10-24 14:45:00	Normal	*Sam	Neutered Male
# A513956	Dog	2017-06-14 11:54:00	Normal	*Sweetie	Spayed Female
# 보호소에 들어온 동물의 이름은 NULL(없음), *Sam, *Sam, *Sweetie입니다. 이 중 NULL과 중복되는 이름을 고려하면, 보호소에 들어온 동물 이름의 수는 2입니다. 따라서 SQL문을 실행하면 다음과 같이 나와야 합니다.

# count
# 2
# ※ 컬럼 이름(위 예제에서는 count)은 일치하지 않아도 됩니다.

In [ ]:
SELECT COUNT(DISTINCT NAME) AS count FROM ANIMAL_INS;

In [ ]:
# 문제설명(3월에 태어난 여성 회원 목록 출력하기)
# MEMBER_PROFILE 테이블에서 생일이 3월인 여성 회원의 ID, 이름, 성별, 생년월일을 조회하는 SQL문을 작성해주세요. 이때 전화번호가 NULL인 경우는 출력대상에서 제외시켜 주시고, 결과는 회원ID를 기준으로 오름차순 정렬해주세요.

# 예시
# MEMBER_PROFILE 테이블이 다음과 같을 때

# MEMBER_ID	MEMBER_NAME	TLNO	GENDER	DATE_OF_BIRTH
# jiho92@naver.com	이지호	01076432111	W	1992-02-12
# jiyoon22@hotmail.com	김지윤	01032324117	W	1992-02-22
# jihoon93@hanmail.net	김지훈	01023258688	M	1993-02-23
# seoyeons@naver.com	박서연	01076482209	W	1993-03-16
# yoonsy94@gmail.com	윤서연	NULL	W	1994-03-19
# SQL을 실행하면 다음과 같이 출력되어야 합니다.

# MEMBER_ID	MEMBER_NAME	GENDER	DATE_OF_BIRTH
# seoyeons@naver.com	박서연	W	1993-03-16

In [ ]:
SELECT MEMBER_ID, MEMBER_NAME, GENDER, DATE_FORMAT(DATE_OF_BIRTH, '%Y-%m-%d') as DATE_OF_BIRTH
FROM MEMBER_PROFILE
WHERE MONTH(DATE_OF_BIRTH) = 3 AND TLNO IS NOT NULL AND GENDER = 'W'
ORDER BY MEMBER_ID ASC;

In [ ]:
# 문제설명(가격대 별 상품 개수 구하기)
# PRODUCT 테이블에서 만원 단위의 가격대 별로 상품 개수를 출력하는 SQL 문을 작성해주세요. 이때 컬럼명은 각각 컬럼명은 PRICE_GROUP, PRODUCTS로 지정해주시고 가격대 정보는 각 구간의 최소금액(10,000원 이상 ~ 20,000 미만인 구간인 경우 10,000)으로 표시해주세요. 결과는 가격대를 기준으로 오름차순 정렬해주세요.

# 예시
# 예를 들어 PRODUCT 테이블이 다음과 같다면

# PRODUCT_ID	PRODUCT_CODE	PRICE
# 1	A1000011	10000
# 2	A1000045	9000
# 3	C3000002	22000
# 4	C3000006	15000
# 5	C3000010	30000
# 6	K1000023	17000
# 만원 단위의 가격대 별로 상품을 나누면

# 가격대가 0원 ~ 1만원 미만인 상품은 PRODUCT_ID 가 2인 상품 1개,
# 가격대가 1만원 이상 ~ 2만원 미만인 상품들은 PRODUCT_ID 가 1, 4, 6인 상품 3개,
# 가격대가 2만원 이상 ~ 3만원 미만인 상품은 PRODUCT_ID 가 3인 상품 1개,
# 가격대가 3만원 이상 ~ 4만원 미만인 상품은 PRODUCT_ID 가 5인 상품 1개,
# 에 각각 해당하므로 다음과 같이 결과가 나와야 합니다.

# PRICE_GROUP	PRODUCTS
# 0	1
# 10000	3
# 20000	1
# 30000	1

| 함수                     | 설명     | 예시(`2.53`) | 비고         |
| ---------------------- | ------ | ---------- | ---------- |
| `FLOOR()`              | 소수점 버림 | 2          | 하한(작거나 같은) |
| `CEIL()` / `CEILING()` | 소수점 올림 | 3          | 상한(크거나 같은) |
| `ROUND()`              | 반올림    | 3          | 표준 반올림     |

In [ ]:
# FLOOR: 가격대를 1만 원 단위로 버림
# 1. 가격을 10 000으로 나누어 1만 원 단위가 몇 번 들어가는지를 구함
# 2. 소수점 이하를 버려 정수만 남김
# 3. 다시 1만 원을 곱해 가격 환산
SELECT FLOOR(PRICE/10000)*10000 AS PRICE_GROUP, COUNT(*) AS PRODUCTS FROM PRODUCT
GROUP BY PRICE_GROUP
ORDER BY PRICE_GROUP ASC;